{
  "_class_name": "AutoencoderKLQwenImage",
  "_diffusers_version": "0.39.0",
  "attn_scales": [],
  "base_dim": 8,
  "dim_mult": [
    1,
    2,
    2
  ],
  "dropout": 0.0,
  "input_channels": 3,
  "latents_mean": [
    0.1,
    -0.2,
    0.3,
    -0.4
  ],
  "latents_std": [
    1.5,
    0.8,
    1.2,
    2.0
  ],
  "num_res_blocks": 2,
  "temperal_downsample": [
    false,
    true
  ],
  "z_dim": 4
}
