{
  "architectures": [
    "Qwen3VLModel"
  ],
  "dtype": "float32",
  "image_token_id": 151655,
  "model_type": "qwen3_vl",
  "text_config": {
    "attention_bias": false,
    "attention_dropout": 0.0,
    "head_dim": 6,
    "hidden_act": "silu",
    "hidden_size": 32,
    "initializer_range": 0.02,
    "intermediate_size": 64,
    "max_position_embeddings": 64,
    "model_type": "qwen3_vl_text",
    "num_attention_heads": 6,
    "num_hidden_layers": 4,
    "num_key_value_heads": 2,
    "pad_token_id": null,
    "rms_norm_eps": 1e-06,
    "rope_parameters": {
      "mrope_interleaved": true,
      "mrope_section": [
        1,
        1,
        1
      ],
      "rope_theta": 5000000,
      "rope_type": "default"
    },
    "tie_word_embeddings": true,
    "use_cache": true,
    "vocab_size": 93
  },
  "tie_word_embeddings": false,
  "transformers_version": "5.13.1",
  "video_token_id": 151656,
  "vision_config": {
    "deepstack_visual_indexes": [
      0,
      1
    ],
    "depth": 2,
    "hidden_act": "gelu_pytorch_tanh",
    "hidden_size": 16,
    "in_channels": 3,
    "initializer_range": 0.02,
    "intermediate_size": 32,
    "model_type": "qwen3_vl_vision",
    "num_heads": 2,
    "num_position_embeddings": 16,
    "out_hidden_size": 32,
    "patch_size": 4,
    "spatial_merge_size": 1,
    "temporal_patch_size": 1
  },
  "vision_end_token_id": 151653,
  "vision_start_token_id": 151652
}
